public_html/org_roam_plantillas.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>org-roam plantillas</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">org-roam plantillas</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org047db20">1. Plantillas</a></li>
<li><a href="#org7f2e2e4">2. Mis plantillas en "init.el"</a></li>
</ul>
</div>
</div>
<p>
Cada vez que se añade una nueva nota en <a href="org_roam.html#ID-80ce4bf8-3936-45bf-adc9-041795828500">org-roam</a> se hace uso de las plantillas que estan definidas en la configuración de emacs. Aquí está la información que he ido recopilando y las plantillas que utilizo.
</p>

<div id="outline-container-org047db20" class="outline-2">
<h2 id="org047db20"><span class="section-number-2">1.</span> Plantillas</h2>
<div class="outline-text-2" id="text-1">
<p>
Se definen con la variable (org-roam-capture-templates)
</p>
<blockquote>
<p>
Existe un bug que no permite añadir una nueva línea editanto la variable anterior, hay que hacerlo en el archivo de configuración mediante "\n".
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org7f2e2e4" class="outline-2">
<h2 id="org7f2e2e4"><span class="section-number-2">2.</span> Mis plantillas en "init.el"</h2>
<div class="outline-text-2" id="text-2">
<p>
Dentro del apartado "custom-set-variables
</p>
<div class="org-src-container">
<pre class="src src-elisp">'(org-roam-capture-templates
   (<span style="color: #8ac6f2; font-weight: bold;">quote</span>
    ((<span style="color: #95e454;">"d"</span> <span style="color: #95e454;">"default"</span> plain <span style="color: #95e454;">"%?"</span> <span style="color: #e5786d;">:target</span>
      (file+head <span style="color: #95e454;">"%&lt;%Y%m%d&gt;-${slug}.org"</span> <span style="color: #95e454;">"#+title: ${title}
#+STARTUP: show2levels
"</span>)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-08-30 mié 00:00</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
